<?php

/*
Распознать все mac-адресы
На дом!
*/
$subject = 'Jan 13 00:48:59: DROP service 68->67(udp) from 213.92.153.167 to 69.43.107.219, prefix: "spoof iana-0/8" (in: eth0 69.43.112.233(38:f8:b7:90:45:92):68 -> 217.70.100.113(00:21:87:79:9c:d9):67 UDP len:576 ttl:64)
Jan 13 12:02:48: ACCEPT service dns from 74.125.186.208 to firewall(pub-nic-dns), prefix: "none" (in: eth0 74.125.186.208(00:1a:e3:52:5d:8e):36008 -> 140.105.63.158(00:1a:9a:86:2e:62):53 UDP len:82 ttl:38)
Jan 13 17:44:52: DROP service 68->67(udp) from 172.45.240.237 to 217.70.177.60, prefix: "spoof iana-0/8" (in: eth0 216.34.90.16(00:21:91:fe:a2:6f):68 -> 69.43.85.253(00:07:e1:7c:53:db):67 UDP len:328 ttl:64)
Jan 13 17:52:08: ACCEPT service http from 213.121.184.130 to firewall(pub-nic), prefix: "none" (in: eth0 213.121.184.130(00:05:2e:6a:a4:14):8504 -> 140.105.63.164(00:60:11:92:ed:1b):80 TCP flags: ****S* len:52 ttl:109)
Jan 14 04:56:08: DROP service 68->67(udp) from 217.70.196.185 to 217.70.92.217, prefix: "spoof iana-0/8" (in: eth0 69.43.195.65(00:26:f4:fd:77:d1):68 -> 172.45.101.249(bc:b8:52:d0:55:33):67 UDP len:576 ttl:64)
Jan 14 06:03:01: DROP service 68->67(udp) from 217.70.20.228 to 213.92.27.87, prefix: "spoof iana-0/8" (in: eth0 216.34.214.4(0c:71:5d:52:6f:65):68 -> 172.45.70.44(00:00:6b:ed:5e:cf):67 UDP len:328 ttl:64)
Jan 12 17:19:19: DROP service 68->67(udp) from 213.92.192.102 to 216.34.131.104, prefix: "spoof iana-0/8" (in: eth0 213.92.247.248(00:26:0c:9c:60:d1):68 -> 69.43.186.115(00:00:9a:48:ab:b8):67 UDP len:576 ttl:64)
Jan 13 10:03:14: DROP service 68->67(udp) from 213.92.20.178 to 216.34.129.47, prefix: "spoof iana-0/8" (in: eth0 213.92.173.212(00:18:12:c1:5a:a4):68 -> 172.45.188.138(3c:83:b5:65:85:ba):67 UDP len:328 ttl:64)
Jan 13 13:53:53: DROP service 68->67(udp) from 213.92.94.147 to 172.45.117.37, prefix: "spoof iana-0/8" (in: eth0 213.92.191.188(00:50:a6:df:da:0e):68 -> 213.92.8.108(08:00:8c:1a:3d:d9):67 UDP len:328 ttl:64)
Jan 13 22:37:54: ACCEPT service dns from 65.55.37.37 to firewall(pub-nic-dns), prefix: "none" (in: eth0 65.55.37.37(00:24:33:8e:ae:b2):12031 -> 140.105.63.158(00:06:f8:c3:60:a4):53 UDP len:69 ttl:51)
Jan 14 03:39:10: ACCEPT service dns from 66.249.66.127 to firewall(pub-nic-dns), prefix: "none" (in: eth0 66.249.66.127(00:18:f5:63:84:7c):46293 -> 140.105.63.158(00:0f:07:cb:10:91):53 UDP len:68 ttl:42)
Jan 14 06:23:28: DROP service 68->67(udp) from 216.34.233.123 to 217.70.226.162, prefix: "spoof iana-0/8" (in: eth0 217.70.30.115(cc:b2:55:30:fd:ff):68 -> 69.43.103.96(00:03:10:58:1c:f9):67 UDP len:328 ttl:64)';

$pattern = '/([0-9|a-z]{2}:){5}[0-9|a-z]{2}/u';

$result = [];

preg_match_all($pattern, $subject, $result);

echo '<pre>';
print_r($result);
echo '</pre>';

/*
Дана база клиентов в файле в одну строку. Распознать данную базу и вывести на экран клиентов в виде таблицы.

$clients = [
    [
        'name' => 'Дидовец Юлий',
        'birthdate' => '24.12.1955',
        'phone' => '+7(775)-724-75-44'
    ],
    [
        'name' => 'Ярославович Юлий',
        'birthdate' => '15.1.1963',
        'phone' => '+7(775)-686-79-72'
    ],
    ....
];
*/

$subject1 = 'Дидовец Юлий;24.12.1955;+7(775)-724-75-44;Ярославович Юлий;15.1.1963;+7(775)-686-79-72;Предыбайло Зенон;19.5.1992;+7(707)-939-39-61;Артемович Лука;17.5.1960;+7(700)-128-43-77;Акс Несвитайло;15.5.1997;+7(771)-923-68-24;Вадимович Мишин;10.8.1967;+7(701)-672-56-40;Викторович Лебедев;29.10.1980;+7(775)-745-73-77;Лука Баранов;22.12.2016;+7(707)-941-72-19;Несвитайло Александрович;9.11.1999;+7(771)-831-44-13;Мишурин Бронислав;22.7.1978;+7(702)-242-26-71;Дидовец Акс;31.4.1967;+7(707)-188-56-17;Станиславович Жерар;27.7.1984;+7(702)-259-86-71;Мишурин Дидовец;5.1.2004;+7(778)-627-41-86;Дидовец Дидовец;27.3.1985;+7(702)-905-73-70;Артёмович Нестор;13.7.1960;+7(771)-635-20-19;Мишурин Мишурин;1.4.2000;+7(700)-137-31-29;Лебедев Баранов;21.9.1993;+7(771)-711-96-11;Ярославович Станиславович;17.11.1988;+7(778)-155-88-52;Акс Дзюба;31.5.2016;+7(775)-829-47-27;Лебедев Артёмович;15.9.2004;+7(700)-902-94-44;Акс Леонидович;20.1.2008;+7(707)-729-29-78;Артемович Акс;14.12.1967;+7(701)-631-45-13;Анатолиевич Лука;22.3.1996;+7(707)-885-76-78;Анатолиевич Лебедев;18.6.2003;+7(700)-363-79-77;Предыбайло Нестор;17.6.1954;+7(778)-816-24-33;Акс Филипп;16.2.2003;+7(778)-154-61-21;Станиславович Лука;24.4.2002;+7(700)-121-51-72;Несвитайло Легойда;5.4.1995;+7(771)-361-51-24;Дзюба Александрович;25.1.1950;+7(771)-473-44-15;Мишин Заур;8.1.2015;+7(701)-889-90-78;Викторович Баранов;31.4.1984;+7(707)-141-36-33;Юлиан Дзюба;11.12.1982;+7(778)-140-16-36;Филипп Баранов;31.3.2000;+7(771)-118-89-94;Артёмович Лука;20.3.1962;+7(702)-116-60-42;Викторович Вадимович;3.5.1966;+7(701)-695-89-88;Юлий Викторович;31.8.2007;+7(700)-894-80-29;Артёмович Баранов;24.3.2016;+7(707)-934-74-62;Артёмович Вадимович;22.7.1967;+7(700)-141-93-40;Леонидович Мишурин;2.9.2012;+7(707)-933-87-60;Акс Анатолиевич;10.11.1980;+7(701)-639-16-77;Филипп Дидовец;16.8.1984;+7(775)-672-51-47;Несвитайло Несвитайло;28.11.1984;+7(701)-789-84-22;Дзюба Юлиан;29.10.1955;+7(707)-579-44-74;Вадимович Заур;25.7.1966;+7(701)-648-75-21;Баранов Викторович;25.10.1992;+7(707)-729-91-28;Легойда Жерар;4.11.1966;+7(702)-260-96-99;Ярославович Мишурин;28.1.2011;+7(700)-315-57-62;Нестор Акс;18.11.1996;+7(702)-385-63-70;Дзюба Леонидович;14.3.1964;+7(701)-620-57-63;Дзюба Бронислав;7.6.2003;+7(707)-119-83-18;Дзюба Александрович;21.2.1961;+7(701)-832-73-90;Юлий Лебедев;2.3.1972;+7(707)-433-12-70;Предыбайло Вадимович;23.4.1996;+7(778)-360-59-36;Вадимович Юлий;4.7.2011;+7(778)-344-59-43;Заур Нестор;25.9.1965;+7(771)-293-14-33;Зенон Леонидович;7.9.1995;+7(701)-476-85-94;Предыбайло Легойда;11.8.1974;+7(771)-714-73-77;Харитонов Станиславович;2.12.1988;+7(775)-298-67-62;Юлиан Легойда;16.11.1961;+7(700)-713-47-28;Вадимович Нестор;29.4.2007;+7(702)-784-28-50;Дзюба Лебедев;30.4.1987;+7(707)-898-50-33;Александрович Викторович;30.1.2015;+7(702)-865-59-94;Лука Ярославович;26.6.2004;+7(707)-701-69-96;Филипп Зенон;13.4.2007;+7(701)-457-42-67;Легойда Нестор;31.8.2004;+7(700)-990-66-24;Дидовец Мишин;3.4.1984;+7(701)-400-32-65;Вадимович Баранов;29.2.1953;+7(700)-670-70-71;Заур Бронислав;30.9.1976;+7(775)-385-39-53;Зенон Вадимович;26.10.1993;+7(771)-993-54-84;Анатолиевич Дзюба;30.12.1981;+7(701)-200-85-47;Александрович Мишурин;13.10.2003;+7(778)-528-22-76;Юлий Юлиан;10.7.1953;+7(771)-696-23-80;Леонидович Заур;3.10.1989;+7(775)-885-54-99;Вадимович Артёмович;1.4.1957;+7(775)-741-59-33;Дзюба Артемович;29.8.1999;+7(707)-225-29-93;Ярославович Харитонов;22.1.1966;+7(707)-149-40-78;Станиславович Лука;24.2.2017;+7(775)-325-74-21;Артёмович Харитонов;25.7.1954;+7(771)-168-52-33;Баранов Анатолиевич;31.7.2010;+7(702)-172-49-92;Леонидович Артёмович;17.10.1985;+7(700)-543-36-57;Заур Ярославович;7.2.1993;+7(702)-154-75-52;Александрович Дидовец;18.2.1980;+7(771)-440-55-76;Филипп Станиславович;24.1.1962;+7(775)-489-93-76;Мишурин Ярославович;24.1.2013;+7(701)-184-20-71;Анатолиевич Викторович;24.3.2007;+7(778)-389-27-55;Жерар Харитонов;25.9.1986;+7(702)-914-80-77;Александрович Предыбайло;25.7.1950;+7(771)-850-12-64;Артемович Ярославович;27.12.1986;+7(771)-696-71-56;Вадимович Заур;12.8.1972;+7(702)-890-59-88;Бронислав Филипп;29.11.1983;+7(707)-410-60-24;Акс Анатолиевич;24.9.1954;+7(701)-362-34-68;Мишурин Викторович;25.3.1962;+7(701)-575-67-94;Харитонов Ярославович;15.9.2011;+7(700)-899-74-28;Заур Лука;2.12.1978;+7(702)-636-49-31;Юлиан Лука;6.10.1958;+7(775)-490-77-84;Дидовец Викторович;2.2.1972;+7(775)-331-12-45;Викторович Мишурин;28.1.1994;+7(771)-352-65-67;Заур Легойда;7.12.1998;+7(701)-118-52-60;Лебедев Акс;8.4.1994;+7(702)-447-83-16;Бронислав Несвитайло;28.4.2015;+7(701)-178-17-98;';

$pattern1 = '/([А-ЯЁа-яё\s]{1,});([0-9\.]{1,});(\+[0-9\(\)\-]{1,});/u';

$result1 = [];

preg_match_all($pattern1, $subject1, $result1);

$clients = [];

foreach($result1[1] as $i => $client) {
    $clients[] = [
        'name' => $client,
        'birthdate' => $result1[2][$i],
        'phone' => $result1[3][$i],
    ];
}

var_dump($clients);